const Map<String, String> translator = {
  // Global
  "1000@global": "الرئيسية",
  "1001@global": "التحميل",
  "1002@global": "البيع المسبق",
  "1003@global": "الوثائق",
  "1004@global": "الوضع الداكن / الساطع",
  "1005@global": "تحميل التطبيق",
  "1006@global": "شراء \$WLTK",
  "1007@global": "انضم للقناة",
  "1008@global": "انضم للمجتمع",
  "1009@global": "الشركة",
  "1010@global": "تابعنا",
  "1011@global": "تعرف على الميزات",
  "1012@global": "اقرأ عنا",
  "1013@global": "شروط الخدمة",
  "1014@global": "سياسة الخصوصية",
  "1015@global": "تويتر",
  "1016@global": "تليجرام",
  "1017@global": "جيت هاب",
  "1018@global": "المحفظة الباردة",
  "1019@global": "المصادقة الثنائية",
  "1020@global": "الإيداع",
  "1021@global": "السحب",
  "1022@global": "بحث",
  "1023@global": "مقالات",
  "1024@global": "نشرت بواسطة",
  "1025@global": "نتائج البحث عن",
  "1026@global": "لا توجد نتائج لـ",
  "1027@global": "كل المواضيع",
  "1028@global": "نسخ",
  "1029@global": "بدون مفتاح",
  "1030@global": "المستند التقني",
  "1031@global": "ماهي Walletika؟",
  "1032@global": "القائمة",
  "1033@global": "وقت البدء",
  "1034@global": "وقت الانتهاء",
  "1035@global": "العرض",
  "1036@global": "السعر",
  "1037@global": "اشتري الآن",
  "1038@global": "الجولة",
  "1039@global": "قادم",
  "1040@global": "متاح الآن",
  "1041@global": "انتهى",
  "1042@global": "نفذ البيع",
  "1043@global": "مُباع",
  "1044@global": "تم",
  "1045@global": "ايام",
  "1046@global": "المبلغ",
  "1047@global": "الدفع",
  "1048@global": "العملات المتاحة",
  "1049@global": "نحن على وشك الانتهاء!",
  "1050@global": "تأكيد",
  "1051@global": "تم النسخ",
  "1052@global": "كمية الطلب",
  "1053@global": "تكلفة الطلب",
  "1054@global": "الشبكات",
  "1055@global": "تم تسجيل الطلب",
  "1056@global": "البيع الخاص",
  "1057@global": "العقد الذكي",
  "1058@global": "\$WLTK تصفح",
  "1059@global": "تبرع",
  "1060@global": "بعد",
  "1061@global": "متبقي",
  "1062@global": "اصدقائنا & شركائنا",
  "1063@global": "تعرف على المؤسس",
  "1064@global": "تواصل",
  "1065@global": "يوتيوب",
  "1066@global": "المجتمع",
  "1067@global": "خارطة الطريق",
  "1068@global": "قريباً",
  "1069@global": "شهادة KYC",
  "1070@global": "تقرير التدقيق",
  "1071@global": "يتضمن خارطة الطريق",
  "1072@global": "اقراء المزيد",
  "1073@global": "ايام",
  "1074@global": "ساعات",
  "1075@global": "دقائق",
  "1076@global": "ثوان",

  // Warns
  "1000@warns": "الحقل مطلوب",
  "1001@warns": "المبلغ صفر",
  "1002@warns": "المبلغ يتجاوز",

  // Home
  "1000@home": "أفضل محفظة تشفير آمنة",
  "1001@home":
      "اختر بين المحفظة الساخنة والباردة للوصول إلى أموالك بسهولة دون الحاجة إلى مفتاح خاص.",
  "1002@home": "لا يتم تخزين بياناتك في أي مكان أبدًا!",
  "1003@home":
      "نحن نقدم أعلى مستوى من الخصوصية والأمان لمستخدمينا بفضل حلولنا الفريدة التي لا تتطلب تخزين بيانات المستخدم على خوادمنا أو حتى أجهزة المستخدم.",
  "1004@home": "",
  "1005@home": "محفظة بدون مفتاح",
  "1006@home":
      "لن تحتاج إلى مفتاح خاص للوصول إلى محفظتك بعد الآن، فنحن نوفر نظام تسجيل دخول لا مركزي بدلاً من ذلك.",
  "1007@home": "المصادقة الثنائية",
  "1008@home":
      "نحن أول محفظة تشفير تدعم المصادقة الثنائية اللامركزية لتأكيد المعاملات، وتضمن هذه الميزة الفريدة أمانًا لا مثيل له في أي مكان.",
  "1009@home": "حافظ على أموالك بأمان",
  "1010@home":
      "قم بتحويل محرك أقراص USB إلى محفظة غير متصلة بالإنترنت وبعيدًا عن المتسللين.",
  "1011@home": "ميزات قوية للوصول إلى مجموعة واسعة من الأصول الرقمية",
  "1012@home": "شبكات بلوكتشين متعدده",
  "1013@home":
      "استمتع بأكثر من +20 شبكة بلوكتشين مختلفة تتيح لك الوصول بحرية إلى مجموعة واسعة من الأصول الرقمية.",
  "1014@home": "محافظ متعددة",
  "1015@home":
      "استمتع بإنشاء وإدارة محافظ غير محدودة لشبكات بلوكتشين المختلفة في مكان واحد.",
  "1016@home": "عملات ورقية متعددة",
  "1017@home":
      "تتبع تغيرات أسعار الأصول الرقمية مقابل العملات الورقية المختلفة مثل الدولار الأمريكي واليورو والجنيه الإسترليني والمزيد.",
  "1018@home": "خدمات استكينج",
  "1019@home":
      "احصل على أقصى استفادة من أصولك الرقمية عن طريق خدمات استكينج مقابل عوائد سنوية مرتفعة.",
  "1020@home": "النسخ الاحتياطي",
  "1021@home":
      "قم بنسخ جميع محافظك احتياطيًا إلى ملف خارجي لتجنب فقدها في حالة فقد جهازك أو تغييره.",
  "1022@home": "إرسال واستقبال",
  "1023@home":
      "أرسل واستقبل أكثر من +10,000 أصل من أصول العملة المشفرة بسهولة وأمان في أي وقت وفي أي مكان.",
  "1024@home": "ابق على تواصل معنا على تليجرام",
  "1025@home":
      "انضم إلى قناة تلجيرام الخاصة بنا لمواكبة آخر التحديثات والتفاعل مع أحد مطورينا.",
  "1026@home": "© 2023 Walletika Ltd. جميع الحقوق محفوظة.",
  "1027@home": "تأسست شركة Walletika على يد محمود خالد.",
  "1028@home":
      "Walletika عبارة عن منصة برمجية، نحن لا نقدم أي نصيحة مالية ولا نقوم بتخزين بيانات مستخدمينا. نسعى دائمًا لتوفير أعلى مستوى من الأمان الذي يضمن حماية البيانات ولسنا مسؤولين عن أي أضرار ناتجة عن سوء الاستخدام. أنت المسؤول الوحيد عن تقييم استثماراتك، وأي استثمار في أصول blockchain ينطوي على مخاطر خسارة جزء أو كل استثمارك. يتحمل مستخدمي Walletika مسؤولية حماية معلومات الوصول الخاصة بهم. إذا فقدت أيًا من معلومات الوصول الخاصة بك، فقد لا تتمكن من الوصول إلى محفظتك مرة أخرى.",
  "1029@home": "يبدء البيع المسبق فى 7 مايو 2024",
  "1030@home": "بطاقات الخصم المباشر من Walletika!",
  "1031@home":
      "أنفق عملاتك المشفرة نقدًا بسهولة في أي وقت وفي كل مكان عبر أجهزة الصراف الآلي.",

  // Download
  "1000@download": "محفظة التشفير الأكثر أمانًا",
  "1001@download":
      "اختر من بين أجهزة متعددة للوصول إلى الأصول الرقمية الخاصة بك وإدارتها في أي وقت وفي أي مكان.",
  "1002@download": "تطبيق الهاتف",
  "1003@download":
      "قم بالتثبيت على هاتفك المحمول للتحكم في ثروتك في أي مكان بسهولة.",
  "1004@download": "تطبيق سطح المكتب",
  "1005@download":
      "قم بالتثبيت كمحفظة ساخنة على جهاز سطح المكتب الخاص بك أو كمحفظة باردة على محرك أقراص USB.",
  "1006@download": "ما هو شعورك تجاه تطبيق Walletika؟",
  "1007@download": "",
  "1008@download":
      "نحن في الإصدار التجريبي، من فضلك لا تودع أموالاً حقيقية. انضم إلى مجموعتنا الآن واطلب إيداعًا لاختبار التطبيق معًا.",

  // Tokenomics
  "1000@tokenomics": "العملة الرئيسية لـ Walletika",
  "1001@tokenomics":
      "عملة WLTK هي الرمز الآمن لمستثمرينا للحصول على فرص استثمارية رائعة للنمو معًا.",
  "1002@tokenomics": "التسويق",
  "1003@tokenomics": "",
  "1004@tokenomics": "العرض محدود",
  "1005@tokenomics":
      "الحد الأقصى للعرض هو 100,000,000 WLTK، مما يضمن عدم التضخم ويجعله توكن منخفض المخاطر وقويًا وموثوقًا من قبل الجميع.",
  "1006@tokenomics": "قابلة لإعادة التدوير",
  "1007@tokenomics":
      "رمز Walletika قابل لإعادة التدوير، من خلال جمعه مقابل خدمات Walletika المدفوعة وإرجاعه إلى بروتوكول استيكنج مرة أخرى.",
  "1008@tokenomics": "لامركزي بالكامل",
  "1009@tokenomics":
      "رمز Walletika لا مركزي بنسبة 100٪ ولا يمكن التحكم في المعاملات مثل إيقافه مؤقتًا أو إضافة محافظ إلى القائمة السوداء.",
  "1010@tokenomics":
      "تم توزيع النسب بناءً على رؤيتنا التي من شأنها توفير أقصى استفادة للمستثمرين في المقام الأول.",
  "1011@tokenomics": "ما قبل البيع",
  "1012@tokenomics": "بيع خاص",
  "1013@tokenomics": "الإدراج على البورصات",
  "1014@tokenomics": "سيولة خدمات استكينج",
  "1015@tokenomics": "الفريق",
  "1016@tokenomics": "الحد الأقصى للعرض 100,000,000 WLTK",
  "1017@tokenomics":
      "انضم إلى مجتمعنا لتكون على اطلاع دائم بمراحل البيع وآخر الأخبار.",
  "1018@tokenomics": "ما هو شعورك تجاه Walletika توكن؟",
  "1019@tokenomics": "شارك في واحدة من أفضل الفرص بأرخص الأسعار!",
  "1020@tokenomics": "مرحلة البيع الخاص",
  "1021@tokenomics": "مرحلة ماقبل البيع",
  "1022@tokenomics": "أفضل فرصة قبل بدء التداول في البورصات!",
  "1023@tokenomics": "كم يمكنك شراء؟",
  "1024@tokenomics": "سوف تشتري",
  "1025@tokenomics": "بدلاً من",
  "1026@tokenomics": "من منصة التداول!",
  "1027@tokenomics":
      "*لا تقم بالإيداع من منصة التداول، ستحصل على عملاتك خلال دقائق قليلة على نفس عنوان الإيداع.",
  "1028@tokenomics": "قم بعمل إيداع",
  "1029@tokenomics": "إلى العنوان التالي",
  "1030@tokenomics":
      "نشكركم على مشاركتكم ودعمكم، وندعوكم للانضمام إلى مجتمعنا ومتابعة حساباتنا على وسائل التواصل الاجتماعي للبقاء على اطلاع بآخر الأخبار.",
  "1031@tokenomics": "محفظة الفريق مقفلة",
  "1032@tokenomics":
      "100% من عملات الفريق مقفلة، ويتم استحقاق 30% منها سنويًا لمدة 4 سنوات.",
  "1033@tokenomics": "لماذا يجب أن أشتري الآن؟",
  "1034@tokenomics": "استلم العملات الخاصة بك فورا",
  "1035@tokenomics": "استيكنج متاح الآن لكسب المزيد من المكافآت",
  "1036@tokenomics": "سعر الادراج 0.15 دولار",
  "1037@tokenomics":
      "الإدراج في أفضل البورصات ByBit, OKX, GateIO, KuCoin, BitMart, Bitget, Pancakeswap",
  "1038@tokenomics": "استرداد 50% على الاستثمار بأكثر من 100 الف دولار",
  "1039@tokenomics": "تم اجراء KYC والتدقيق بواسطة Cyberscope",
  "1040@tokenomics": "%100 من محفظة الفريق مقفلة",
  "1041@tokenomics": "يبدأ البيع بعد",
  "1042@tokenomics": "ينتهي البيع بعد",
  "1043@tokenomics": "انتهى البيع",
  "1044@tokenomics": "+%50 عائد",
  "1045@tokenomics":
      "كن بين أوائل المالكين الذين يحصلون على أكبر قدر من المكافآت.",

  // Documents
  "1000@docs": "وثائق Walletika",
  "1001@docs": "كيف يمكننا مساعدتك؟",
  "1002@docs": "ما رأيك في هذا المقال؟",
  "1003@docs":
      "إذا لم تتمكن من العثور على نتائج بحث مفيدة، فيرجى الاتصال بنا لمساعدتك، قد نفكر في كتابة مقال عن موضوعك.",
};
