const Map<String, String> translator = {
  // Global
  "1000@global": "الرئيسية",
  "1001@global": "التحميل",
  "1002@global": "العملة",
  "1003@global": "الوثائق",
  "1004@global": "الوضع الداكن / الساطع",
  "1005@global": "تحميل مجاني",
  "1006@global": "شراء WTK",
  "1007@global": "الانضمام للقناة",
  "1008@global": "الانضمام للمجموعة",
  "1009@global": "الشركة",
  "1010@global": "تابعنا",
  "1011@global": "تعرف على الميزات",
  "1012@global": "اقرأ عنا",
  "1013@global": "شروط الخدمة",
  "1014@global": "سياسة الخصوصية",
  "1015@global": "تويتر",
  "1016@global": "تليجرام",
  "1017@global": "جيت هاب",
  "1018@global": "المحفظة الباردة",
  "1019@global": "المصادقة الثنائية",
  "1020@global": "الإيداع",
  "1021@global": "السحب",
  "1022@global": "بحث",
  "1023@global": "مقالات",
  "1024@global": "نشرت بواسطة",
  "1025@global": "نتائج البحث عن",
  "1026@global": "لا توجد نتائج لـ",
  "1027@global": "كل المواضيع",
  "1028@global": "نسخ",
  "1029@global": "بدون مفتاح",
  "1030@global": "المستند التقني",
  "1031@global": "ماهي Walletika؟",
  "1032@global": "القائمة",
  "1033@global": "وقت البدء",
  "1034@global": "وقت الانتهاء",
  "1035@global": "العرض",
  "1036@global": "السعر",
  "1037@global": "اشتري الآن",
  "1038@global": "الجولة",
  "1039@global": "قادم",
  "1040@global": "متاح الآن",
  "1041@global": "انتهى",
  "1042@global": "مكتمل",
  "1043@global": "مُباع",
  "1044@global": "تم",
  "1045@global": "ايام",
  "1046@global": "المبلغ",
  "1047@global": "الدفع",
  "1048@global": "العملات المتاحة",
  "1049@global": "نحن على وشك الانتهاء!",
  "1050@global": "تأكيد",
  "1051@global": "تم النسخ",
  "1052@global": "كمية الطلب",
  "1053@global": "تكلفة الطلب",
  "1054@global": "الشبكات المقبولة",
  "1055@global": "تم تسجيل الطلب",
  "1056@global": "البيع متاح الآن",
  "1057@global": "تصفح العقد الذكي",
  "1058@global": "\$WTK تصفح",
  "1059@global": "تبرع",

  // Warns
  "1000@warns": "الحقل مطلوب",
  "1001@warns": "المبلغ صفر",
  "1002@warns": "المبلغ يتجاوز",

  // Home
  "1000@home": "أفضل محفظة تشفير آمنة",
  "1001@home":
      "اختر بين المحفظة الساخنة والباردة للوصول إلى أموالك بسهولة دون الحاجة إلى مفتاح خاص.",
  "1002@home": "نحن لا نخزن بيانات مستخدمينا",
  "1003@home":
      "لا يتم تخزين معلومات الوصول إلى المحفظة على خوادمنا أو حتى أجهزة المستخدم، وذلك بفضل تقنيتنا الفريدة التي تعيد إنشاء المحفظة في كل مرة يتم فيها إجراء معاملة.",
  "1004@home": "",
  "1005@home": "محفظة بدون مفتاح",
  "1006@home":
      "لا تحتاج إلى مفتاح خاص للوصول إلى محفظتك بعد الآن، فنحن نقدم نظام تسجيل دخول لامركزي باسم مستخدم وكلمتين من كلمات المرور التي يمكن حفظها ذهنيًا.",
  "1007@home": "دعم المصادقة الثنائية",
  "1008@home":
      "أموالك محمية بقوة المصادقة الثنائية، ولا يمكن إجراء أي معاملات الا بعد تأكيد الرمز المكون من 6 أرقام والذي يتغير كل 30 ثانية.",
  "1009@home": "حافظ على أموالك بأمان",
  "1010@home":
      "قم بتحويل محرك أقراص USB إلى محفظة غير متصلة بالإنترنت وبعيدًا عن المتسللين.",
  "1011@home": "ميزات قوية للوصول إلى مجموعة واسعة من الأصول الرقمية",
  "1012@home": "شبكات بلوكتشين متعدده",
  "1013@home":
      "استمتع بأكثر من +20 شبكة بلوكتشين مختلفة افتراضيًا وامكانية إضافة المزيد يدويًا.",
  "1014@home": "محافظ متعددة",
  "1015@home":
      "قم بإنشاء وإدارة محافظ غير محدودة على جميع شبكات بلوكتشين من مكان واحد.",
  "1016@home": "عملات ورقية متعددة",
  "1017@home":
      "شاهد تغيرات أسعار الأصول الرقمية مقابل العملات الورقية المختلفة مثل الدولار الأمريكي واليورو والجنيه الإسترليني والمزيد.",
  "1018@home": "التخزين",
  "1019@home":
      "احصل على أقصى استفادة من أصولك الرقمية مع خدمات التخزين مقابل عائد سنوي.",
  "1020@home": "النسخ الاحتياطي",
  "1021@home":
      "قم بنسخ جميع محافظك احتياطيًا إلى ملف خارجي لتجنب فقدها في حالة فقد جهازك أو تغييره.",
  "1022@home": "إرسال واستقبال",
  "1023@home":
      "أرسل واستقبل أكثر من +10,000 أصل من أصول العملة المشفرة بسهولة وأمان في أي وقت وفي أي مكان.",
  "1024@home": "ابق على تواصل معنا على تليجرام",
  "1025@home":
      "انضم إلى قناة تلجيرام الخاصة بنا لمواكبة آخر التحديثات والتفاعل مع أحد مطورينا.",
  "1026@home": "© 2023 Walletika Ltd. جميع الحقوق محفوظة.",
  "1027@home": "تأسست شركة Walletika على يد محمود خالد.",
  "1028@home":
      "Walletika عبارة عن منصة برمجية، نحن لا نقدم أي نصيحة مالية ولا نقوم بتخزين بيانات مستخدمينا. نسعى دائمًا لتوفير أعلى مستوى من الأمان الذي يضمن حماية البيانات ولسنا مسؤولين عن أي أضرار ناتجة عن سوء الاستخدام. أنت المسؤول الوحيد عن تقييم استثماراتك، وأي استثمار في أصول blockchain ينطوي على مخاطر خسارة جزء أو كل استثمارك. يتحمل مستخدمي Walletika مسؤولية حماية معلومات الوصول الخاصة بهم. إذا فقدت أيًا من معلومات الوصول الخاصة بك، فقد لا تتمكن من الوصول إلى محفظتك مرة أخرى.",
  "1029@home": "الفريق المؤسس",
  "1030@home": "اصدقائنا",

  // Download
  "1000@download": "محفظة التشفير الأكثر أمانًا",
  "1001@download":
      "اختر من بين أجهزة متعددة للوصول إلى الأصول الرقمية الخاصة بك وإدارتها في أي وقت وفي أي مكان.",
  "1002@download": "تطبيق الهاتف",
  "1003@download":
      "قم بالتثبيت على هاتفك المحمول للتحكم في ثروتك في أي مكان بسهولة.",
  "1004@download": "تطبيق سطح المكتب",
  "1005@download":
      "قم بالتثبيت كمحفظة ساخنة على جهاز سطح المكتب الخاص بك أو كمحفظة باردة على محرك أقراص USB.",
  "1006@download": "ما هو شعورك تجاه تطبيق Walletika؟",
  "1007@download": "الحزمة ستكون متاحة قريبا",
  "1008@download":
      "نحن في الإصدار التجريبي، من فضلك لا تودع أموالاً حقيقية. انضم إلى مجموعتنا الآن واطلب إيداعًا لاختبار التطبيق معًا.",

  // Tokenomics
  "1000@tokenomics": "العملة الرئيسية لـ Walletika",
  "1001@tokenomics":
      "نحن نقدم رمزًا آمنًا لمستثمرينا للحصول على فرص استثمارية رائعة للنمو معًا.",
  "1002@tokenomics": "",
  "1003@tokenomics": "2.5% شراكة SCO",
  "1004@tokenomics": "العرض محدود",
  "1005@tokenomics":
      "الحد الأقصى للعرض هو 100,000,000 WTK، مما يضمن عدم التضخم ويجعله توكن منخفض المخاطر وقويًا وموثوقًا من قبل الجميع.",
  "1006@tokenomics": "قابلة لإعادة التدوير",
  "1007@tokenomics":
      "رمز Walletika قابل لإعادة التدوير، من خلال جمعه مقابل خدمات Walletika المدفوعة وإعادة ضخة في تمويل خدمات استكينج مره اخري.",
  "1008@tokenomics": "لامركزي بالكامل",
  "1009@tokenomics":
      "لا مركزي بنسبة 100% ولا يمكن التحكم في المعاملات مثل تجميد المحافظ أو الأرصدة.",
  "1010@tokenomics":
      "تم توزيع النسب بناءً على رؤيتنا التي من شأنها توفير أقصى استفادة للمستثمرين في المقام الأول.",
  "1011@tokenomics": "35% ما قبل البيع",
  "1012@tokenomics": "2.5% بيع خاص",
  "1013@tokenomics": "13% الإدراج على المنصات المركزية واللامركزية",
  "1014@tokenomics": "30% سيولة خدمات استكينج",
  "1015@tokenomics": "17% الفريق واستراتيجيات التسويق",
  "1016@tokenomics": "الحد الأقصى للعرض 100,000,000 WTK",
  "1017@tokenomics":
      "انضم إلى مجتمعنا لتكون على اطلاع دائم بمراحل البيع وآخر الأخبار.",
  "1018@tokenomics": "ما هو شعورك تجاه Walletika توكن؟",
  "1019@tokenomics": "شارك في واحدة من أفضل الفرص بأرخص الأسعار!",
  "1020@tokenomics": "بيع خاص يحقق x50 لكل \$1 ارتفاع",
  "1021@tokenomics": "ماقبل البيع يحقق x10 لكل \$1 ارتفاع",
  "1022@tokenomics": "أفضل فرصة قبل بدء التداول في البورصات!",
  "1023@tokenomics": "كم يمكنك شراء؟",
  "1024@tokenomics": "سوف تشتري",
  "1025@tokenomics": "بدلاً من",
  "1026@tokenomics": "من منصة التداول!",
  "1027@tokenomics":
      "*ستتلقى العملات الخاصة بك على نفس عنوان الإيداع (لا تقم بالإيداع من منصة التداول).",
  "1028@tokenomics": "قم بعمل إيداع",
  "1029@tokenomics": "إلى العنوان التالي",
  "1030@tokenomics":
      "نشكركم على مشاركتكم ودعمكم، وندعوكم للانضمام إلى مجتمعنا ومتابعة حساباتنا على وسائل التواصل الاجتماعي للبقاء على اطلاع بآخر الأخبار.",

  // Documents
  "1000@docs": "وثائق Walletika",
  "1001@docs": "كيف يمكننا مساعدتك؟",
  "1002@docs": "ما رأيك في هذا المقال؟",
  "1003@docs":
      "إذا لم تتمكن من العثور على نتائج بحث مفيدة، فيرجى الاتصال بنا لمساعدتك، قد نفكر في كتابة مقال عن موضوعك.",
};
