const Map<String, String> translator = {
  // Global
  "1000@global": "الرئيسية",
  "1001@global": "التحميل",
  "1002@global": "التوكن",
  "1003@global": "الوثائق",
  "1004@global": "الوضع الداكن / الساطع",
  "1005@global": "تحميل مجاني",
  "1006@global": "شراء WTK",
  "1007@global": "الانضمام للقناة",
  "1008@global": "الانضمام للمجموعة",
  "1009@global": "الشركة",
  "1010@global": "تابعنا",
  "1011@global": "ميزات",
  "1012@global": "عنا",
  "1013@global": "شروط الخدمة",
  "1014@global": "سياسة الخصوصية",
  "1015@global": "تويتر",
  "1016@global": "تليجرام",
  "1017@global": "جيت هاب",
  "1018@global": "المحفظة الباردة",
  "1019@global": "المصادقة الثنائية",
  "1020@global": "الإيداع",
  "1021@global": "السحب",
  "1022@global": "بحث",
  "1023@global": "مقالات",
  "1024@global": "نشرت بواسطة",
  "1025@global": "نتائج البحث عن",
  "1026@global": "لا توجد نتائج لـ",
  "1027@global": "كل المواضيع",
  "1028@global": "نسخ",
  "1029@global": "بدون مفتاح",

  // Home
  "1000@home": "أفضل محفظة تشفير آمنة",
  "1001@home":
      "اختر بين المحفظة الساخنة والباردة للوصول إلى أموالك بسهولة دون الحاجة إلى مفتاح خاص.",
  "1002@home": "نحن لا نخزن بياناتك",
  "1003@home":
      "لا يتم تخزين معلومات الوصول إلى محافظك على خوادمنا أو حتى على جهازك، وذلك بفضل تقنيتنا الفريدة لإعادة إنشاء المحفظة في كل مرة يتم فيها إجراء المعاملات بدلاً من تخزينها.",
  "1004@home": "",
  "1005@home": "محفظة بدون مفتاح",
  "1006@home":
      "لا تحتاج إلى مفتاح خاص ”قابل للفقدان“ للوصول إلى محفظتك بعد الآن، فنحن نقدم حلاً فريدًا بدلاً من ذلك باستخدام اسم مستخدم وكلمتين مرور يمكن حفظهما ذهنيًا.",
  "1007@home": "دعم المصادقة الثنائية",
  "1008@home":
      "أموالك محمية بقوة المصادقة الثنائية، ولا يمكن إجراء أي معاملات الا بعد تأكيد الرمز المكون من 6 أرقام والذي يتغير كل 30 ثانية.",
  "1009@home": "حافظ على أموالك بأمان",
  "1010@home":
      "قم بتحويل محرك أقراص USB إلى محفظة غير متصلة بالإنترنت وبعيدًا عن المتسللين.",
  "1011@home": "ميزات قوية للوصول إلى مجموعة واسعة من الأصول الرقمية",
  "1012@home": "شبكات بلوكتشين متعدده",
  "1013@home":
      "استمتع بأكثر من +20 شبكة بلوكتشين مختلفة افتراضيًا وامكانية إضافة المزيد يدويًا.",
  "1014@home": "محافظ متعددة",
  "1015@home":
      "قم بإنشاء وإدارة محافظ غير محدودة على جميع شبكات بلوكتشين من مكان واحد.",
  "1016@home": "عملات ورقية متعددة",
  "1017@home":
      "شاهد تغيرات أسعار الأصول الرقمية مقابل العملات الورقية المختلفة مثل الدولار الأمريكي واليورو والجنيه الإسترليني والمزيد.",
  "1018@home": "التخزين",
  "1019@home":
      "احصل على أقصى استفادة من أصولك الرقمية مع خدمات التخزين مقابل عائد سنوي.",
  "1020@home": "النسخ الاحتياطي",
  "1021@home":
      "قم بنسخ جميع محافظك احتياطيًا إلى ملف خارجي لتجنب فقدها في حالة فقد جهازك أو تغييره.",
  "1022@home": "إرسال واستقبال",
  "1023@home":
      "أرسل واستقبل أكثر من +10,000 أصل من أصول العملة المشفرة بسهولة وأمان في أي وقت وفي أي مكان.",
  "1024@home": "ابق على تواصل معنا على تليجرام",
  "1025@home":
      "انضم إلى قناة تلجيرام الخاصة بنا لمواكبة آخر التحديثات والتفاعل مع أحد مطورينا.",
  "1026@home": "© 2023 Walletika Ltd. جميع الحقوق محفوظة.",

  // Download
  "1000@download": "محفظة التشفير الأكثر أمانًا",
  "1001@download":
      "اختر من بين أجهزة متعددة للوصول إلى الأصول الرقمية الخاصة بك وإدارتها في أي وقت وفي أي مكان.",
  "1002@download": "تطبيق الهاتف",
  "1003@download":
      "قم بالتثبيت على هاتفك المحمول للتحكم في ثروتك في أي مكان بسهولة.",
  "1004@download": "تطبيق سطح المكتب",
  "1005@download":
      "قم بالتثبيت كمحفظة ساخنة على جهاز سطح المكتب الخاص بك أو كمحفظة باردة على محرك أقراص USB.",
  "1006@download": "ما هو شعورك تجاه تطبيق Walletika؟",
  "1007@download": "الحزمة ستكون متاحة قريبا",
  "1008@download":
      "نحن في المرحلة التجريبية، لتجربة التطبيق انضم إلى مجموعة التليجرام الخاصه بنا وطالب بالأموال على الشبكة التجريبيه، لا تودع أموالًا حقيقية.",

  // Documents
  "1000@docs": "وثائق Walletika",
  "1001@docs": "كيف يمكننا مساعدتك؟",
  "1002@docs": "ما رأيك في هذا المقال؟",
  "1003@docs":
      "إذا لم تتمكن من العثور على نتائج بحث مفيدة، فيرجى الاتصال بنا لمساعدتك، قد نفكر في كتابة مقال عن موضوعك.",
};
